PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
typedef struct {
	int32_t erpm;
	bool ready;
	float rate_hz;
	uint64_t last_timestamp;
} erpm_data_t;

typedef struct {
	uint8_t value;
	bool ready;
	float rate_hz;
	uint64_t last_timestamp;
} edt_data_t;

// Adaptive base interval per channel, scaled by 8 for sub-tick precision (ticks_per_bit * 8)
static uint32_t _base_interval_x8[MAX_TIMER_IO_CHANNELS] = { [0 ...(MAX_TIMER_IO_CHANNELS - 1)] = 168 }; // 21 * 8

static volatile erpm_data_t _erpms[MAX_TIMER_IO_CHANNELS] = {};
static volatile edt_data_t _edt_temp[MAX_TIMER_IO_CHANNELS] = {};
static volatile edt_data_t _edt_volt[MAX_TIMER_IO_CHANNELS] = {};
static volatile edt_data_t _edt_curr[MAX_TIMER_IO_CHANNELS] = {};

static float calculate_rate_hz(uint64_t last_timestamp, float last_rate_hz, uint64_t timestamp);

// hrt callback handle for captcomp post dma processing per timer
static struct hrt_call _cc_calls[MAX_IO_TIMERS];

// decoding status for each channel
static uint32_t read_ok[MAX_TIMER_IO_CHANNELS] = {};
static uint32_t read_fail_crc[MAX_TIMER_IO_CHANNELS] = {};

static perf_counter_t capture_complete_perf = NULL;
static perf_counter_t burst_perf = NULL;
static perf_counter_t capture_window_perf = NULL;

static void init_timer_config(uint32_t channel_mask)
{
	// Mark timers in use, channels in use, and timers for bdshot
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (channel_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;

			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

			if (timer_channel >= 4) {
				// invalid channel, only 0 - 3
				continue;
			}

			if (io_timers[timer_index].dshot.dma_base == 0) {
				// board does not configure dshot on this timer
				continue;
			}

			timer_configs[timer_index].timer_index = timer_index;
			timer_configs[timer_index].enabled = true;
			timer_configs[timer_index].enabled_channels[timer_channel] = true;

			// TODO: bdshot per timer not on all timers
			// Mark timer as bidirectional
			if (_bdshot_channel_mask & (1 << output_channel)) {
				timer_configs[timer_index].bidirectional = true;
			}
		}
	}
}

// Initializes dshot on configured timers if DShot mode is enabled and DMA is available.
static void init_timers_dma_up(void)
{
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled) {
			// timer is not enabled for dshot
			continue;
		}

		if (io_timers[timer_index].dshot.dma_map_up == 0) {
			// timer does not have DMA UP mapped
			continue;
		}

		// Attempt to allocate DMA for Burst
		timer_configs[timer_index].dma_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

		if (timer_configs[timer_index].dma_handle == NULL) {
			PX4_WARN("Failed to allocate Timer %u DMA UP", timer_index);
			continue;
		}

		PX4_INFO("Allocated DMA UP Timer Index %u", timer_index);
		timer_configs[timer_index].initialized = true;
	}

	// Bidirectional DShot will free/allocate DMA stream on every update event. This is required
	// in order to reconfigure the DMA stream between Timer Burst and CaptureCompare.
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].bidirectional) {
			continue;
		}

		if (timer_configs[timer_index].dma_handle != NULL) {
			stm32_dmafree(timer_configs[timer_index].dma_handle);
			timer_configs[timer_index].dma_handle = NULL;
			PX4_INFO("Freed DMA UP Timer Index %u", timer_index);
		}
	}
}

static int32_t init_timer_channels(uint8_t timer_index)
{
	int32_t channels_init_mask = 0;

	if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
		// timer is not enabled or could not be initialized
		return 0;
	}

	io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted :
				       IOTimerChanMode_Dshot;

	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

		if (timer_channel >= 4) {
			// invalid channel, only 0 - 3
			continue;
		}

		bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel];

		if (this_timer && channel_enabled) {
			int ret = io_timer_channel_init(output_channel, mode, NULL, NULL);

			if (ret != OK) {
				PX4_WARN("io_timer_channel_init %u failed", output_channel);
				continue;
			}

			timer_configs[timer_index].initialized_channels[timer_channel] = true;
			channels_init_mask |= (1 << output_channel);

			PX4_DEBUG("%sDShot initialized OutputChannel %u", timer_configs[timer_index].bidirectional ? "B" : "", output_channel);
		}
	}

	return channels_init_mask;
}

int up_dshot_init(uint32_t channel_mask, uint32_t bdshot_channel_mask, unsigned dshot_pwm_freq, bool edt_enable)
{
	_dshot_frequency = dshot_pwm_freq;
	_bdshot_channel_mask = bdshot_channel_mask;
	_edt_enabled = edt_enable;

	// Precompute capture delay: 30us switch time + frame time + 20us margin
	hrt_abstime frame_us = (16 * 1000000) / _dshot_frequency;
	_bdshot_capture_delay = 30 + frame_us + 20;

	if (bdshot_channel_mask) {
		// TODO: show which timers/channels it's enabled on
		PX4_INFO("BDShot enabled");
		capture_complete_perf = perf_alloc(PC_ELAPSED, "dshot: capture complete");
		burst_perf = perf_alloc(PC_INTERVAL, "dshot: burst perf");
		capture_window_perf = perf_alloc(PC_INTERVAL, "dshot: capture window");
	}

	// NOTE: All timers are triggered in a loop with a small delay.
	// Each timer needs its own DMA channel, re-used for burst transmit and then capture.
	// For bidirectional DShot, each timer uses round-robin capture (1 channel per timer per cycle).

	// Initialize timer_config data based on enabled channels
	init_timer_config(channel_mask);

	// Initializes dshot on each timer if DShot mode is enabled and DMA is available
	init_timers_dma_up();

	int32_t channels_init_mask = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		channels_init_mask |= init_timer_channels(timer_index);
	}

	unsigned output_buffer_offset = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].initialized) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[output_buffer_offset];

#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			output_buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (output_buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	// Mark BDShot channels without capture DMA as processed (so they don't block ready count)
	// and track which channels support capture
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (bdshot_channel_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

