PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			if (timer_channel < 4) {
				if (io_timers[timer_index].dshot.dma_map_ch[timer_channel] != 0) {
					_bdshot_capture_supported[output_channel] = true;

				} else {
					// No DMA for capture on this channel - mark as ready so it doesn't block
					_bdshot_ready_mask |= (1u << output_channel);
					PX4_WARN("BDShot capture not supported on output %u (no DMA)", output_channel);
				}
			}
		}
	}

	return channels_init_mask;
}

// ESC boot delay - wait for ESCs to initialize before enabling BDShot capture
static const uint64_t ESC_BOOT_DELAY_US = 3000000;

// Start burst DMA for a single timer
static void dshot_start_timer_burst(uint8_t timer_index)
{
	timer_config_t *timer = &timer_configs[timer_index];
	io_timer_channel_mode_t mode = timer->bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot;

	io_timer_set_enable(true, mode, io_timer_get_group(timer_index));

	uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
	io_timer_set_dshot_burst_mode(timer_index, _dshot_frequency, channel_count);

	if (timer->bidirectional) {
		// Deallocate DMA from previous transaction
		if (timer->dma_handle != NULL) {
			stm32_dmastop(timer->dma_handle);
			stm32_dmafree(timer->dma_handle);
			timer->dma_handle = NULL;
		}

		// Allocate DMA
		timer->dma_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

		if (timer->dma_handle == NULL) {
			PX4_WARN("DMA allocation for timer %u failed", timer_index);
			_bdshot_cycle_complete[timer_index] = true;
			return;
		}
	}

	// Flush cache so DMA sees the data
	up_clean_dcache((uintptr_t)dshot_output_buffer[timer_index],
			(uintptr_t)dshot_output_buffer[timer_index] +
			DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

	px4_stm32_dmasetup(timer->dma_handle,
			   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
			   (uint32_t)(dshot_output_buffer[timer_index]),
			   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
			   DSHOT_DMA_SCR);

	// Clean UDE flag before DMA is started
	io_timer_update_dma_req(timer_index, false);

	// Trigger DMA. For BDShot after boot delay, use callback for capture setup.
	if (timer->bidirectional && (hrt_absolute_time() > ESC_BOOT_DELAY_US)) {
		perf_begin(burst_perf);
		stm32_dmastart(timer->dma_handle, dma_burst_finished_callback, &timer->timer_index, false);

	} else {
		// Standard DShot or BDShot during boot - no capture needed
		stm32_dmastart(timer->dma_handle, NULL, NULL, false);

		if (timer->bidirectional) {
			// During boot, mark BDShot cycle complete immediately
			_bdshot_cycle_complete[timer_index] = true;
		}
	}

	// Enable DMA update request
	io_timer_update_dma_req(timer_index, true);
}

// Kicks off DMA transmit for all configured timers simultaneously
void up_dshot_trigger()
{
	for (int i = 0; i < MAX_IO_TIMERS; i++) {
		if (!_bdshot_cycle_complete[i]) {
			PX4_WARN("Cycle not complete, check system jitter!");
			return;
		}
	}

	// Mark all BDShot timers as cycle incomplete and start all timers
	uint8_t bdshot_timers_started = 0;

	for (uint8_t i = 0; i < MAX_IO_TIMERS; i++) {
		if (timer_configs[i].enabled && timer_configs[i].initialized) {
			if (timer_configs[i].bidirectional) {
				// Stagger between bidirectional timer bursts to prevent response frame overlap.
				// Response frames arrive ~30us after burst, and reconfiguring for capture takes >15us.
				if (bdshot_timers_started > 0) {
					px4_udelay(10);
				}

				_bdshot_cycle_complete[i] = false;
				bdshot_timers_started++;
			}

			dshot_start_timer_burst(i);
		}
	}
}

static void select_next_capture_channel(uint8_t timer_index)
{
	int current = timer_configs[timer_index].capture_channel;

	// Try each of the 4 possible channels, starting from current+1
	for (int i = 1; i <= 4; i++) {
		int next = (current + i) % 4;

		if (timer_configs[timer_index].initialized_channels[next]) {
			uint8_t output_channel = output_channel_from_timer_channel(timer_index, next);

			if (output_channel >= MAX_TIMER_IO_CHANNELS) {
				continue;
			}

			// Only capture from channels that support BDShot (have DMA mapping)
			if (_bdshot_capture_supported[output_channel]) {
				timer_configs[timer_index].capture_channel = next;
				return;
			}
		}
	}
}

static uint8_t output_channel_from_timer_channel(uint8_t timer_index, uint8_t timer_channel_index)
{
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t channel_index = timer_io_channels[output_channel].timer_channel;

		if (is_this_timer && (channel_index == timer_channel_index)) {
			// We found the output channel associated with this timer channel
			return output_channel;
		}
	}

	return MAX_TIMER_IO_CHANNELS;
}

void dma_burst_finished_callback(DMA_HANDLE handle, uint8_t status, void *arg)
{
	uint8_t timer_index = *((uint8_t *)arg);

	timer_config_t *timer = &timer_configs[timer_index];

	// TODO: revisit logic for DMA failure handling (does it occur?)
	// if (status != DMA_STATUS_SUCCESS) {
	// }

	// For standard DShot or BDShot during boot: no capture needed
	if (!timer->bidirectional || (hrt_absolute_time() <= ESC_BOOT_DELAY_US)) {
		return;
	}

	// Clean DMA UP configuration
	if (timer->dma_handle != NULL) {
		stm32_dmastop(timer->dma_handle);
		stm32_dmafree(timer->dma_handle);
		timer->dma_handle = NULL;
	}

	// Disable DMA update request
	io_timer_update_dma_req(timer_index, false);

	// De-allocate timer
	io_timer_unallocate_timer(timer_index);

	// Flush cache so DMA sees the data
	memset(dshot_capture_buffer[timer_index], 0, sizeof(dshot_capture_buffer[timer_index]));
	up_clean_dcache((uintptr_t) dshot_capture_buffer[timer_index],
			(uintptr_t) dshot_capture_buffer[timer_index] + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Re-initialize the current capture channel back to CaptureDMA
	uint8_t capture_output_channel = output_channel_from_timer_channel(timer_index, timer_configs[timer_index].capture_channel);

	if (capture_output_channel < MAX_TIMER_IO_CHANNELS) {
		io_timer_unallocate_channel(capture_output_channel);
		io_timer_channel_init(capture_output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);
	}

	// Select the next capture channel
	select_next_capture_channel(timer_index);

	// Allocate DMA for currently selected capture_channel
	uint8_t capture_channel = timer_configs[timer_index].capture_channel;
	timer_configs[timer_index].dma_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_ch[capture_channel]);

	// If DMA handler is invalid, skip capture
	if (timer->dma_handle == NULL) {
		PX4_WARN("failed to allocate dma for timer %u channel %u", timer_index, capture_channel);

