PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
		// Restore the capture channel back to DshotInverted (was set to CaptureDMA above)
		if (capture_output_channel < MAX_TIMER_IO_CHANNELS) {
			io_timer_unallocate_channel(capture_output_channel);
			io_timer_channel_init(capture_output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}

		perf_end(burst_perf);
		_bdshot_cycle_complete[timer_index] = true;
		return;
	}

	// Set Capture mode for this channel
	io_timer_set_dshot_capture_mode(timer_index, capture_channel, _dshot_frequency);
	io_timer_capture_dma_req(timer_index, capture_channel, true);

	// Choose which CC register for this DMA stream
	uint32_t periph_addr = io_timers[timer_index].base + STM32_GTIM_CCR1_OFFSET + (4 * capture_channel);

	// Setup DMA for this channel
	px4_stm32_dmasetup(timer_configs[timer_index].dma_handle,
			   periph_addr,
			   (uint32_t) dshot_capture_buffer[timer_index][capture_channel],
			   CHANNEL_CAPTURE_BUFF_SIZE,
			   DSHOT_BIDIRECTIONAL_DMA_SCR);

	// NOTE: we can't use DMA callback since GCR encoding creates a variable length pulse train. Instead
	// we use an hrt callback to schedule the processing of the received and DMAd eRPM frames.
	stm32_dmastart(timer_configs[timer_index].dma_handle, NULL, NULL, false);

	// Enable CaptureDMA on this timer's channels only
	io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, io_timer_get_group(timer_index));

	perf_end(burst_perf);
	perf_begin(capture_window_perf);

	hrt_call_after(&_cc_calls[timer_index], _bdshot_capture_delay, capture_complete_callback, arg);
}

static void capture_complete_callback(void *arg)
{
	perf_end(capture_window_perf);
	perf_begin(capture_complete_perf);

	uint8_t timer_index = *((uint8_t *)arg);

	// Unallocate the timer as CaptureDMA
	io_timer_unallocate_timer(timer_index);

	uint8_t capture_channel = timer_configs[timer_index].capture_channel;

	// Disable capture DMA
	io_timer_capture_dma_req(timer_index, capture_channel, false);

	// Stop DMA (should already be finished)
	stm32_dmastop(timer_configs[timer_index].dma_handle);

	// Re-initialize all output channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (is_this_timer && channel_initialized) {
			io_timer_unallocate_channel(output_channel);
			// Initialize back to DShotInverted to bring IO back to the expected idle state
			io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}
	}

	// Invalidate the dcache to ensure most recent data is available
	up_invalidate_dcache((uintptr_t) dshot_capture_buffer[timer_index],
			     (uintptr_t) dshot_capture_buffer[timer_index] + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Process eRPM frames from all channels on this timer
	process_capture_results(timer_index, capture_channel);

	// Enable this timer's channels as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, io_timer_get_group(timer_index));

	perf_end(capture_complete_perf);

	_bdshot_cycle_complete[timer_index] = true;
}

void process_capture_results(uint8_t timer_index, uint8_t channel_index)
{
	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);

	if (output_channel >= MAX_TIMER_IO_CHANNELS) {
		return;
	}

	uint32_t value = convert_edge_intervals_to_bitstream(timer_index, channel_index);

	// Decode RLL
	value = (value ^ (value >> 1));

	// Decode GCR
	uint32_t payload = gcr_decode[value & 0x1f];
	payload |= gcr_decode[(value >> 5) & 0x1f] << 4;
	payload |= gcr_decode[(value >> 10) & 0x1f] << 8;
	payload |= gcr_decode[(value >> 15) & 0x1f] << 12;

	// Calculate checksum
	uint32_t checksum = payload;
	checksum = checksum ^ (checksum >> 8);
	checksum = checksum ^ (checksum >> NIBBLES_SIZE);

	if ((checksum & 0xF) != 0xF) {
		++read_fail_crc[output_channel];

		if (_consecutive_failures[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
			_consecutive_failures[output_channel] = BDSHOT_OFFLINE_COUNT;
			_consecutive_successes[output_channel] = 0;
			_bdshot_online[output_channel] = false;
		}

		_bdshot_ready_mask |= (1u << output_channel);
		return;
	}

	++read_ok[output_channel];

	if (_consecutive_successes[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
		_consecutive_successes[output_channel] = BDSHOT_OFFLINE_COUNT;
		_consecutive_failures[output_channel] = 0;
		_bdshot_online[output_channel] = true;
	}

	// Convert payload into telem type/value
	struct BDShotTelemetry packet = {};
	payload = (payload >> 4) & 0xFFF;
	decode_dshot_telemetry(payload, &packet);

	hrt_abstime now = hrt_absolute_time();

	switch (packet.type) {
	case DSHOT_EDT_ERPM: {
			_erpms[output_channel].erpm = packet.value;
			_erpms[output_channel].ready = true;

			uint64_t last_timestamp = _erpms[output_channel].last_timestamp;
			float last_rate_hz = _erpms[output_channel].rate_hz;
			_erpms[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_erpms[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_TEMPERATURE: {
			_edt_temp[output_channel].value = packet.value;
			_edt_temp[output_channel].ready = true;

			uint64_t last_timestamp = _edt_temp[output_channel].last_timestamp;
			float last_rate_hz = _edt_temp[output_channel].rate_hz;
			_edt_temp[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_temp[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_VOLTAGE: {
			_edt_volt[output_channel].value = packet.value;
			_edt_volt[output_channel].ready = true;

			uint64_t last_timestamp = _edt_volt[output_channel].last_timestamp;
			float last_rate_hz = _edt_volt[output_channel].rate_hz;
			_edt_volt[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_volt[output_channel].last_timestamp = now;
			break;
		}

